##  Rearrange Products Table Leetcode Task15

In [18]:
import pandas as pd
import numpy as np

In [20]:
data = [[0, 95, 100, 105], [1, 70, None, 80]]
Products = pd.DataFrame(data, columns=['product_id', 'store1', 'store2', 'store3']).fillna(-1).astype({'product_id':'int64', 'store1':'int64', 'store2':'int64', 'store3':'int64'})

In [22]:
Products

   product_id  store1  store2  store3
0           0      95     100     105
1           1      70      -1      80

In [26]:
# Melt the DataFrame to reshape it
melted = pd.melt(Products, id_vars=['product_id'], value_vars=['store1', 'store2', 'store3'], var_name='store', value_name='price')
melted=melted[melted['price']>-1].sort_values(by='product_id')
melted

   product_id   store  price
0           0  store1     95
2           0  store2    100
4           0  store3    105
1           1  store1     70
5           1  store3     80